{
"article_id": "FIN-001",
"headline": "Tesla stock soars 22% for best day in over a decade on Musk’s 2025 growth projection",
"content": "Tesla shares soared 22% to close at $260.48 on Thursday, the stock’s best day since 2013, following the company’s better-than-expected earnings report.The company late Wednesday reported revenue of $25.18 billion, which came in just under analysts’ expectations of $25.37 billion, but was up 8% compared with a year earlier. Tesla reported earnings per share of 72 cents adjusted, topping the average analyst estimate of 58 cents.“We expect this surprising earnings beat to power a strong positive reaction in Tesla shares Thursday, given the degree to which investors have become conditioned to earnings misses from the company,” analysts at JPMorgan wrote in a note.Tesla’s profit margins in the third quarter were boosted by $739 million in revenue for environmental regulatory credits, which the JPMorgan analysts noted were a “potentially unsustainable driver” of earnings and cash flow.Automakers are required to obtain a certain amount of regulatory credits every year, and if they can’t meet the target, they can buy credits from other companies. Tesla has excess credits because it only makes electric vehicles.Tesla earnings also got a boost from FSD, the company’s Full Self-Driving Supervised system. CFO Vaibhav Taneja said on the earnings call that FSD contributed $326 million in revenue in the quarter after Tesla made it available for use in the Cybertruck and added a feature called “Actually Smart Summon.”CEO Elon Musk said on the call that his “best guess” is that “vehicle growth” will reach 20% to 30% next year, citing “lower cost vehicles” and the “advent of autonomy.” Analysts surveyed by FactSet were expecting delivery growth of about 15% for 2025.Even bullish Deutsche Bank analysts doubted Musk’s forecast and wrote, in a note following the earnings report, “Our view remains more reserved at 10-15% (~2.03m),” and assumes Tesla can roll out a cheaper version of its Model Y at a price under $30,000 after subsidies, and other variants of the small SUV.Analysts at Morgan Stanley who also recommend buying the stock, called Musk’s 2025 vehicle delivery growth prediction a “maybe.” They set their estimate at 14%.It “clearly depends on the company’s ability to improve affordability through cheaper model (next gen) introduction, financing offers and improved features,” the Morgan Stanley analysts wrote in a note Thursday.A grain of saltMusk said on the Wednesday call that Tesla plans to start production of its recently unveiled Cybercab, a robotaxi with butterfly doors and no steering wheel or pedals, by the end of 2026. He also said Tesla would conduct driverless ridehailing in California and Texas next year in its existing cars, which are not currently safe to use without a human driver ready to steer or brake at any time.Bernstein analysts, who have a bearish price target of $120 on shares of Tesla, wrote in a note out Thursday: “The tone of Tesla’s conference call was ebullient and filled with Musk prognostications that have historically polarized bull and bear investors, and was more akin to a pep rally, with the company only taking two questions from sell-siders.”Musk has for years promised shareholders a software upgrade that can turn Teslas into robotaxis. That hasn’t happened yet. Musk has also promised a refreshed version of the Tesla Roadster since 2017. The design of the vehicle is not yet complete. The Bernstein analysts wrote, “We continue to struggle to see Tesla overcoming the technological and regulatory hurdles needed to leapfrog current level 4 robotaxis, and believe fully unsupervised FSD could be years away.”They pointed to Musk’s “long history of being overly optimistic about FSD” and said crowdsourced research that shows “Tesla continues to lag well behind competitors” on robotaxis. The share rally Thursday was the sharpest since a 24% gain in May 2013. The jump erased Tesla’s loss for the year and left the stock up 3% in 2024, though it still trails the 22% gain for the Nasdaq.",
"published_at": "2024-10-22T16:00:00Z"
}