{
    "article_id": "FIN_001",
    "headline": "Tata Capital IPO in July? SEBI clears Rs 17,200 crore IPO draft: Report",
    "content": " he upcoming IPO action in July is getting more hectic by the hour. Apart from NSDL, JSW  Cement, another mega financial IPO may well be on its way. According to Economic Times, Tata Capital may look at a July date for its launch. The website quoted sources and stated that this subsidiary of Tata Sons, is a step closer to launching its Rs 17,200 crore initial public offering (IPO). According to ET,  the Securities and Exchange Board of India (SEBI) has approved the company’s draft documents filed through the confidential route. nce SEBI clears a confidential draft red herring prospectus (DRHP), the company would file an updated version publicly on the regulator’s website. The red herring prospectus (RHP) can be filed just ahead of the IPO launch.. Tata Capital IPO in July? . According to Economic Times,  Tata Capital may file its RHP in the first week of July. An email sent to Tata Capital for confirmation remained unanswered at the time of press.. One of the biggest IPOs in the financial sector. The upcoming IPO will be one of the largest ever in India’s financial sector. It will include both a fresh issue of shares and an offer for sale by Tata Sons, which holds 93% of the company’s equity. Tata Capital had filed the confidential DRHP on April 5. .As per Reserve Bank of India (RBI) regulations, both Tata Sons and Tata Capital are classified as “upper-layer” non-banking financial companies (NBFCs). This classification means they must list on the stock exchange by September 2025. Upper-layer NBFCs are selected by the RBI based on certain criteria and must follow stricter rules. In January, the RBI identified 15 such NBFCs for 2024–25, including Tata Capital.. Tata Capital: Market valuation and financial performance. Tata Capital’s unlisted shares have risen 13.5% over the last six months and are currently trading at around Rs 1,050 per share, valuing the company at nearly Rs 3.8 lakh crore.",
    "published_at": "2025-6-21T14:22:00Z" 
}

